def main():
    """
    Функция, которая принимает на вход строку и возвращает ее со всеми заглавными буквами
    """
    st = input()
    print(st.upper())


def main2():
    """
    Функция делает заглавными первые буквы каждого слова в строке
    """
    st = input()
    print(st.title())


def main3():
    """
    Функция для вызова ошибки
    """
    print("Программист звонит в библиотеку.\n— Здравствуйте, Катю можно?\n— Она в архиве.\n— Разархивируйте ее пожалуйста. Она мне срочно нужна!")
